In [35]:
import sqlite3

working with database using SQL (Structured quey language)

1.create a connection object.

2.from the connection object,create a cursor object.

3.Using the cursor object,call the execute method with create table query as the parameter

# Create Database

In [36]:
# student_database will bw created in Jupyter notebook Home

#first connection object
db=sqlite3.connect("studnet_database.db")

Cursor
A cursor in SQL is a temporary work area created in system memory when a SQL statement is executed.
A sql cursor is a set of rows together with apointer that identifies a current row.
It is a address object to reterive data from a result set one row at a time.

In [37]:
# create a cursor object from connection

cur=db.cursor()

# Create table in Student database

SQL data types---
integer --- numberic values
real ------ decimal values
text ----- character values
char(20) ----- character values

In [4]:
cur.execute("create table student (id int primary key,name text,marks int)")

# Insert data in student table

In [5]:
cur.execute("insert into student(id,name,marks) values(1,'John',66)")
db.commit()

In [6]:
print(cur.rowcount,"Record(s) inserted")

1 Record(s) inserted

In [7]:
cur.execute("insert into student(id,name,marks) values (2,'andrew',88)")
db.commit()

In [8]:
print(cur.rowcount,"Records(s) inserted")

1 Records(s) inserted

In [9]:
results=cur.execute("select * from student")

for row in results:
    print(row)

(1, 'John', 66)
(2, 'andrew', 88)

In [10]:
cur.execute("insert into student(id,name,marks) values (3,'teena',99)")
db.commit()

In [11]:
print(cur.rowcount,"Record(s) inserted")

1 Record(s) inserted

In [12]:
result=cur.execute("select * from student")
                   
                   
for row in results:
    print(row)

(1, 'John', 66)
(2, 'andrew', 88)
(3, 'teena', 99)

In [13]:
cur.execute("insert into student(id,name,marks) values (4,'David',69)")
db.commit()

In [14]:
print(cur.rowcount, "Record(s) inserted")

1 Record(s) inserted

In [28]:
result=cur.execute("select * from student")
 
for row in results:
     print(row)

In [29]:
cur.execute("insert into student values (9,'kiara',99),(10,'Lion',76)")
db.commit()
#count of records inseretd 
print (cur.rowcount,"Record(s) inserted")

2 Record(s) inserted

In [30]:
results= cur.execute("select * from student")
for row in results:
    print(row)

(1, 'John', 66)
(2, 'andrew', 88)
(3, 'teena', 99)
(4, 'David', 69)
(5, 'mona', 87)
(6, 'meena', 88)
(7, 'yusuf', 86)
(8, 'yusu', 96)
(9, 'kiara', 99)
(10, 'Lion', 76)

In [16]:
cur.execute("insert into student(id,name,marks) values(5,'mona',87)")
db.commit()

In [17]:
print(cur.rowcount, "record(s) inserted")

1 record(s) inserted

In [18]:
results=cur.execute("select * from student")

for row in results:
    print(row)

(1, 'John', 66)
(2, 'andrew', 88)
(3, 'teena', 99)
(4, 'David', 69)
(5, 'mona', 87)

In [19]:
cur.execute("insert into student (id,name,marks) values (6,'meena',88)")
db.commit()

In [20]:
cur.execute("insert into student (id,name,marks) values (7,'yusuf', 86)")
db.commit()

In [21]:
results=cur.execute("select * from student")
for row in results:
    print(row)

(1, 'John', 66)
(2, 'andrew', 88)
(3, 'teena', 99)
(4, 'David', 69)
(5, 'mona', 87)
(6, 'meena', 88)
(7, 'yusuf', 86)

In [22]:
results=cur.execute("select * from student")
for row in results:
    print(row)

(1, 'John', 66)
(2, 'andrew', 88)
(3, 'teena', 99)
(4, 'David', 69)
(5, 'mona', 87)
(6, 'meena', 88)
(7, 'yusuf', 86)

In [23]:
cur.execute("insert into student (id,name,marks) values (8,'yusu', 96)")
db.commit()

In [24]:
results=cur.execute("select * from student")
for row in results:
    print(row)

(1, 'John', 66)
(2, 'andrew', 88)
(3, 'teena', 99)
(4, 'David', 69)
(5, 'mona', 87)
(6, 'meena', 88)
(7, 'yusuf', 86)
(8, 'yusu', 96)

DATABASE WILL BE CREATED IN THE GIVEN LOCATION

In [9]:
db1=sqlite3.connect("E:\MY SQLITE_database/studentcourse.db")

In [10]:
cur1=db1.cursor()

In [12]:
cur1.execute("create table employee(id int, name text, age int)")

In [13]:
cur1.execute("Insert into employee values(1,'Melina', 34)")

In [14]:
print(cur1.rowcount, "record(s) inserted")

1 record(s) inserted

In [15]:
results=cur1.execute("select * from employee")
for row in results:
    print(row)

(1, 'Melina', 34)

Accessing data stored in SQLITE using PYTHON

In [10]:
results=cur.execute("Select * from student")

for i in results:
    print(i)

(1, 'John', 66)
(2, 'andrew', 88)
(3, 'teena', 99)
(4, 'David', 69)
(5, 'mona', 87)
(6, 'meena', 88)
(7, 'yusuf', 86)
(8, 'yusu', 96)
(9, 'kiara', 99)
(10, 'Lion', 76)

In [11]:
results=cur.execute("Select id,name from student")
for i in results:
    print(i)

(1, 'John')
(2, 'andrew')
(3, 'teena')
(4, 'David')
(5, 'mona')
(6, 'meena')
(7, 'yusuf')
(8, 'yusu')
(9, 'kiara')
(10, 'Lion')

In [13]:
results=cur.execute("Select marks from student")
for i in results:
    print(i)

(66,)
(88,)
(99,)
(69,)
(87,)
(88,)
(86,)
(96,)
(99,)
(76,)

In [14]:
results=cur.execute("Select * from student where id=1")
for i in results:
    print(i)

(1, 'John', 66)

In [16]:
results=cur.execute("Select id,marks from student")
for i in results:
    print(i)

(1, 66)
(2, 88)
(3, 99)
(4, 69)
(5, 87)
(6, 88)
(7, 86)
(8, 96)
(9, 99)
(10, 76)

In [17]:
results=cur.execute("Select *from student where id=1")
for i in results:
    print(i)

(1, 'John', 66)

In [18]:
results=cur.execute("Select *from student where id=3")
for i in results:
    print(i)

(3, 'teena', 99)

In [19]:
results=cur.execute("Select *from student where id=8")
for i in results:
    print(i)

(8, 'yusu', 96)

In [20]:
resuils=cur.execute("Select *from student limit 3")
for i in results:
    print(i)

(1, 'John', 66)
(2, 'andrew', 88)
(3, 'teena', 99)

In [21]:
results=cur.execute("Select name from student where id =2")
for i in results:
    print(i)

('andrew',)

In [22]:
results=cur.execute("Select marks from student where id=3")
for i in results:
    print(i)

(99,)

In [25]:
results=cur.execute("Select * from student where name='John'")
for i in results:
    print(i)

(1, 'John', 66)

In [26]:
results=cur.execute("Select marks from student where name='John'")
for i in results:
    print(i)

(66,)

In [27]:
results=cur.execute("Select *from student where marks >60  and marks<90")
for i in results:
    print(i)

(1, 'John', 66)
(2, 'andrew', 88)
(4, 'David', 69)
(5, 'mona', 87)
(6, 'meena', 88)
(7, 'yusuf', 86)
(10, 'Lion', 76)

Logical operators

In [28]:
results=cur.execute("Select *from student where marks>35 and marks<78 ")
for  i in results:
    print(i)

(1, 'John', 66)
(4, 'David', 69)
(10, 'Lion', 76)

In [31]:
results=cur.execute("Select *from student where marks>87")
for i in results:
    print(i)

(2, 'andrew', 88)
(3, 'teena', 99)
(6, 'meena', 88)
(8, 'yusu', 96)
(9, 'kiara', 99)

In [9]:
results=cur.execute('Select *from student')
results.fetchall()

[(1, 'John', 66),
 (2, 'andrew', 88),
 (3, 'teena', 99),
 (4, 'David', 69),
 (5, 'mona', 87),
 (6, 'meena', 88),
 (7, 'yusuf', 86),
 (8, 'yusu', 96),
 (9, 'kiara', 99),
 (10, 'Lion', 76)]

Clauses acessnding order and decending order

In [34]:
results=cur.execute('Select * from student order by name asc')
for i in results:
    print(i)

(4, 'David', 69)
(1, 'John', 66)
(10, 'Lion', 76)
(2, 'andrew', 88)
(9, 'kiara', 99)
(6, 'meena', 88)
(5, 'mona', 87)
(3, 'teena', 99)
(8, 'yusu', 96)
(7, 'yusuf', 86)

In [37]:
results=cur.execute('Select * from student order by name desc')
for i in results:
    print(i)

(7, 'yusuf', 86)
(8, 'yusu', 96)
(3, 'teena', 99)
(5, 'mona', 87)
(6, 'meena', 88)
(9, 'kiara', 99)
(2, 'andrew', 88)
(10, 'Lion', 76)
(1, 'John', 66)
(4, 'David', 69)

In [40]:
results=cur.execute("Select * from student where name ='David' and marks=60")
for i in results:
    print(i)

In [41]:
results=cur.execute("Select * from student where name ='David' and marks=69")
for i in results:
    print(i)

(4, 'David', 69)

In [42]:
results=cur.execute("Select * from student where id =2 and marks=70")
for i in results:
    print(i)

In [43]:
results=cur.execute("Select *from student where id=2 or marks=70")
for i in results:
    print(i)

(2, 'andrew', 88)

In [44]:
results=cur.execute("Select *from student where id=4 or marks=99")
for i in results:
    print(i)

(3, 'teena', 99)
(4, 'David', 69)
(9, 'kiara', 99)

In [46]:
results=cur.execute("Select * from student where id=3 or marks=69")
results.fetchall()

[(3, 'teena', 99), (4, 'David', 69)]

aggregate functions


MIN ---- FIND MINIMUM
MAX------ FIND MAXIMUM
AWG ---- FIND AVERAGE 
SUM ----- FIND SUM
COUNT----- COUNT THE  NUMBER OF ROWS


USE FETCHONE FOR SINGLE ANSWER

In [48]:
results=cur.execute("Select max(marks) from student")
for i in results:
    print(i)

(99,)

In [49]:
results=cur.execute("Select min(marks) from student")
for i in results:
    print(i)

(66,)

In [51]:
results=cur.execute("Select avg(marks) from student")
for i in results:
    print(i)

(85.4,)

In [52]:
results=cur.execute("Select sum(marks) from student")
for i in results:
    print(i)

(854,)

In [54]:
results=cur.execute("Select count(id) from student")
for i in results:
    print(i)

(10,)

In [55]:
results=cur.execute("Select *from student where marks between 65 and 86")
for i in results:
    print(i)

(1, 'John', 66)
(4, 'David', 69)
(7, 'yusuf', 86)
(10, 'Lion', 76)

In [5]:
results=cur.execute("Select *from student where id=2 or marks=88")
for i in results:
    print(i)

(2, 'andrew', 88)
(6, 'meena', 88)

In [8]:
results=cur.execute("Select * from student order by name desc")

results.fetchall()

[(7, 'yusuf', 86),
 (8, 'yusu', 96),
 (3, 'teena', 99),
 (5, 'mona', 87),
 (6, 'meena', 88),
 (9, 'kiara', 99),
 (2, 'andrew', 88),
 (10, 'Lion', 76),
 (1, 'John', 66),
 (4, 'David', 69)]

In [10]:
results=cur.execute("Select avg(marks) from student")
for i in results:
    print(i)

(85.4,)

In [11]:
results=cur.execute("Select count(id) from student")
for i in results:
    print(i)

(10,)

In [12]:
results=cur.execute("Select *from student where marks between 55 and 87")
for i in results:
    print(i)

(1, 'John', 66)
(4, 'David', 69)
(5, 'mona', 87)
(7, 'yusuf', 86)
(10, 'Lion', 76)

In [14]:
results=cur.execute("Select max(marks) from student")


results.fetchone()

(99,)

In [15]:
results=cur.execute("Select max(marks) from student")


results.fetchall()

[(99,)]

In [16]:
results=cur.execute("Select min(marks) from student")


results.fetchone()

(66,)

In [17]:
results=cur.execute("Select avg(marks) from student")


results.fetchone()

(85.4,)

In [18]:
results=cur.execute("Select sum(marks) from student")


results.fetchone()

(854,)

In [19]:
results=cur.execute("Select count(id) from student")


results.fetchone()

(10,)

In [21]:
results=cur.execute("Select * from student where marks between 86 and 95")

for i in results:
    print(i)

(2, 'andrew', 88)
(5, 'mona', 87)
(6, 'meena', 88)
(7, 'yusuf', 86)

In [22]:
results=cur.execute("Select *from student where marks is not null")

for i in results:
    print(i)

(1, 'John', 66)
(2, 'andrew', 88)
(3, 'teena', 99)
(4, 'David', 69)
(5, 'mona', 87)
(6, 'meena', 88)
(7, 'yusuf', 86)
(8, 'yusu', 96)
(9, 'kiara', 99)
(10, 'Lion', 76)

In [23]:
results=cur.execute("Select *from student where marks is  null")

for i in results:
    print(i)

LIKE OPERATORS

In [26]:
results=cur.execute("Select *from student where name  like 'D%'")

for i in results:
    print(i)

(4, 'David', 69)

In [33]:
results=cur.execute("Select *from student where name like 'a%'")

for i in results:
    print(i)

(2, 'andrew', 88)

In [34]:
results=cur.execute("Select *from student where name like 'y%'")

for i in results:
    print(i)

(7, 'yusuf', 86)
(8, 'yusu', 96)

In [38]:
results=cur.execute("Select *from student where name like '_a%'")

for i in results:
    print(i)

(4, 'David', 69)

In [39]:
results=cur.execute("Select *from student where name like '__a%'")

for i in results:
    print(i)

(9, 'kiara', 99)

In [42]:
results=cur.execute("Select *from student where name like '___a%'")

for i in results:
    print(i)

(5, 'mona', 87)

In [44]:
results=cur.execute("Select *from student where name like '_u%'")

for i in results:
    print(i)

(7, 'yusuf', 86)
(8, 'yusu', 96)

In [46]:
results=cur.execute("Select *from student where name like '__s%'")

for i in results:
    print(i)

(7, 'yusuf', 86)
(8, 'yusu', 96)

In [47]:
results=cur.execute("Select *from student where name like '_i%'")

for i in results:
    print(i)

(9, 'kiara', 99)
(10, 'Lion', 76)

In [50]:
results=cur.execute("Select *from student where name like 'l%'")

for i in results:
    print(i)

(10, 'Lion', 76)

In [53]:
results=cur.execute("Select *from student where name like '%e%'")

for i in results:
    print(i)

(2, 'andrew', 88)
(3, 'teena', 99)
(6, 'meena', 88)

In [57]:
results=cur.execute("Select * from student")

results.fetchall()

[(1, 'John', 66),
 (2, 'andrew', 88),
 (3, 'teena', 99),
 (4, 'David', 69),
 (5, 'mona', 87),
 (6, 'meena', 88),
 (7, 'yusuf', 86),
 (8, 'yusu', 96),
 (9, 'kiara', 99),
 (10, 'Lion', 76)]

In [58]:
results=cur.execute("Select *from student where name like '____'")

for i in results:
    print(i)

(1, 'John', 66)
(5, 'mona', 87)
(8, 'yusu', 96)
(10, 'Lion', 76)

In [59]:
results=cur.execute("Select *from student where name like '_____'")

for i in results:
    print(i)

(3, 'teena', 99)
(4, 'David', 69)
(6, 'meena', 88)
(7, 'yusuf', 86)
(9, 'kiara', 99)

In [62]:
results=cur.execute("Select *from student where marks NOT in (70)")

results.fetchall()

[(1, 'John', 66),
 (2, 'andrew', 88),
 (3, 'teena', 99),
 (4, 'David', 69),
 (5, 'mona', 87),
 (6, 'meena', 88),
 (7, 'yusuf', 86),
 (8, 'yusu', 96),
 (9, 'kiara', 99),
 (10, 'Lion', 76)]

In [65]:
results=cur.execute("Select *from student where name NOT in ('yusu')")

for i in results:
    print(i)

(1, 'John', 66)
(2, 'andrew', 88)
(3, 'teena', 99)
(4, 'David', 69)
(5, 'mona', 87)
(6, 'meena', 88)
(7, 'yusuf', 86)
(9, 'kiara', 99)
(10, 'Lion', 76)

 UPDATE  RECORD

In [9]:
# update the record

sql="update student set marks= 81 where id = 4"
cur.execute(sql)

In [10]:
results=cur.execute("Select *from student where id = 4")
for row in results:
    print(row)

(4, 'David', 81)

In [11]:
results=cur.execute("Select * from student")
for row in results:
    print(row)

(1, 'John', 66)
(2, 'andrew', 88)
(3, 'teena', 99)
(4, 'David', 81)
(5, 'mona', 87)
(6, 'meena', 88)
(7, 'yusuf', 86)
(8, 'yusu', 96)
(9, 'kiara', 99)
(10, 'Lion', 76)

In [15]:
#update multiple records


sql="update student set marks =92 where id in (1,2)"
cur.execute(sql)

In [16]:
results= cur.execute ("Select *from student")
for row in results:
    print(row)

(1, 'John', 92)
(2, 'andrew', 92)
(3, 'teena', 99)
(4, 'David', 81)
(5, 'mona', 87)
(6, 'meena', 88)
(7, 'yusuf', 86)
(8, 'yusu', 96)
(9, 'kiara', 99)
(10, 'Lion', 76)

In [18]:
#multiple records update ussing'IN'

sql="UPDATE student SET marks = 68 WHERE id IN( 5,6)"
cur.execute(sql)

#verify is it updated
results =cur.execute("Select * from student")
for row in results:
    print(row)

(1, 'John', 92)
(2, 'andrew', 92)
(3, 'teena', 99)
(4, 'David', 81)
(5, 'mona', 68)
(6, 'meena', 68)
(7, 'yusuf', 86)
(8, 'yusu', 96)
(9, 'kiara', 99)
(10, 'Lion', 76)

# DELETE ANY UNWANTED DATA

In [19]:
sql ="delete from student where id= 6"
cur.execute(sql)

In [20]:
results =cur.execute("Select * from student")
for row in results:
    print(row)

(1, 'John', 92)
(2, 'andrew', 92)
(3, 'teena', 99)
(4, 'David', 81)
(5, 'mona', 68)
(7, 'yusuf', 86)
(8, 'yusu', 96)
(9, 'kiara', 99)
(10, 'Lion', 76)

In [22]:
sql= "delete from student where id =4"

cur.execute(sql)


results =cur.execute("Select * from student")
results.fetchall()

[(1, 'John', 92),
 (2, 'andrew', 92),
 (3, 'teena', 99),
 (5, 'mona', 68),
 (7, 'yusuf', 86),
 (8, 'yusu', 96),
 (9, 'kiara', 99),
 (10, 'Lion', 76)]

# DROP TABLE STUDENT

In [23]:
sql='drop table student'


reults=cur.execute(sql)

In [24]:
results =cur.execute("Select * from student")
results.fetchall()

OperationalError: no such table: student

In [25]:
db.close()

# Adding data in table with CSV(Comma seperated values ) file directly

In [1]:
import sqlite3

In [2]:
db=sqlite3.connect("E:\MY SQLITE_database/scores_database.db")
cursor=db.cursor()

In [3]:
#create table

cursor.execute("CREATE TABLE scores(gender TEXT, student_id INT PRIMARY KEY, marks INT)")

In [4]:
#insert  records into the table  (Single recors inseting)

cursor.execute("INSERT INTO scores(gender, student_id, marks) values('Male', 100, 55 )")

#save the record permanently (if yo don't commit, next time will not see the records in the table)


db.commit()

#Couunt of records inserted 

print (cursor.rowcount," Record(s) inserted")

1  Record(s) inserted

# Insertiing records from CSV Files

In [5]:
with open ('Scores_file.csv','r') as file:
    total_records=0
    for row in file:
        cursor.execute("insert into scores values(?,?,?)",row.split(","))
        db.commit()
        total_records+=1
print(total_records,'Records inserted')

10 Records inserted

In [9]:
result=cursor.execute("SELECT * FROM scores")
for row in result:
    print(row)

('Male', 100, 55)
('Male', 111, 55)
('female', 888, 55)
('male', 555, 67)
('female', 333, 55)
('male', 666, 66)
('female', 777, 76)
('male', 222, 45)
('female', 212, 66)
('male', 223, 78)
('female', 444, 67)